Финансы/src/DataProcessors/ПоискСоответствияМеждуТранзакциямиИДокументами/ПоискСоответствияМеждуТранзакциямиИДокументами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПоискСоответствияМеждуТранзакциямиИДокументами</name>
  <attributes>
    <name>НачальнаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечнаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>CatalogRef.СчетаУчета</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Финансы/src/AccumulationRegisters/ДвиженияДенежныхСредств/ДвиженияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвиженияДенежныхСредств</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаПрихода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>CatalogRef.СчетаУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВалютаДвижения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДоходовРасходов</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоРасходовДенежныхСредств</name>
    <type>
      <types>CatalogRef.МестаРасходовДенежныхСредств</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Финансы/src/InformationRegisters/ИсторияТранзакций/ИсторияТранзакций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияТранзакций</name>
  <resources>
    <name>ДатаТранзакции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаФиксацииТранзакции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МестоПлатежа1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МестоПлатежа2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Город</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Страна</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДокументТранзакции</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>CatalogRef.СчетаУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Транзакция</name>
    <type>
      <types>CatalogRef.Транзакции</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Финансы/src/DataProcessors/ПоискСоответствияМеждуТранзакциямиИДокументами/Forms/Форма/Module.bsl
&НаКлиенте
Процедура КомандаИскатьСоответствия(Команда)
	
	КомандаИскатьСоответствияНаСервере(Объект.НачальнаяДата, Объект.КонечнаяДата, Объект.СчетУчета);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура КомандаИскатьСоответствияНаСервере(НачальнаяДата, КонечнаяДата, СчетУчета)

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ДвиженияДенежныхСредствОбороты.Период, ДЕНЬ) КАК Период,
		|	ДвиженияДенежныхСредствОбороты.Регистратор,
		|	ДвиженияДенежныхСредствОбороты.СуммаРасходаОборот
		|ПОМЕСТИТЬ ВведенныеДокументы
		|ИЗ
		|	РегистрНакопления.ДвиженияДенежныхСредств.Обороты(НАЧАЛОПЕРИОДА(&Дата1, ДЕНЬ), КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ), Регистратор, СчетУчета = &СчетУчета) КАК ДвиженияДенежныхСредствОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсторияТранзакций.СчетУчета,
		|	ИсторияТранзакций.Транзакция,
		|	ИсторияТранзакций.ДатаТранзакции,
		|	ИсторияТранзакций.ДатаФиксацииТранзакции,
		|	ИсторияТранзакций.Валюта,
		|	ИсторияТранзакций.МестоПлатежа1,
		|	ИсторияТранзакций.МестоПлатежа2,
		|	ИсторияТранзакций.Город,
		|	ИсторияТранзакций.Страна,
		|	ИсторияТранзакций.Сумма1,
		|	ИсторияТранзакций.Сумма2,
		|	ИсторияТранзакций.ДатаЗагрузки,
		|	ИсторияТранзакций.ДокументТранзакции
		|ПОМЕСТИТЬ ТранзакцииПоСчету
		|ИЗ
		|	РегистрСведений.ИсторияТранзакций КАК ИсторияТранзакций
		|ГДЕ
		|	ИсторияТранзакций.СчетУчета = &СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВведенныеДокументы.Регистратор,
		|	ТранзакцииПоСчету.СчетУчета,
		|	ТранзакцииПоСчету.Транзакция
		|ПОМЕСТИТЬ НайденныеСоответствияВПеровмПриближении
		|ИЗ
		|	ВведенныеДокументы КАК ВведенныеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТранзакцииПоСчету КАК ТранзакцииПоСчету
		|		ПО ВведенныеДокументы.Период = ТранзакцииПоСчету.ДатаТранзакции
		|			И ВведенныеДокументы.СуммаРасходаОборот = ТранзакцииПоСчету.Сумма2
		|ГДЕ
		|	НЕ ТранзакцииПоСчету.СчетУчета ЕСТЬ NULL 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НайденныеСоответствияВПеровмПриближении.СчетУчета,
		|	НайденныеСоответствияВПеровмПриближении.Транзакция,
		|	НайденныеСоответствияВПеровмПриближении.Регистратор
		|ИЗ
		|	НайденныеСоответствияВПеровмПриближении КАК НайденныеСоответствияВПеровмПриближении
		|ГДЕ
		|	НЕ НайденныеСоответствияВПеровмПриближении.Регистратор В
		|				(ВЫБРАТЬ
		|					НайденныеСоответствияВПеровмПриближении.Регистратор
		|				ИЗ
		|					НайденныеСоответствияВПеровмПриближении КАК НайденныеСоответствияВПеровмПриближении
		|				СГРУППИРОВАТЬ ПО
		|					НайденныеСоответствияВПеровмПриближении.Регистратор
		|				ИМЕЮЩИЕ
		|					КОЛИЧЕСТВО(НайденныеСоответствияВПеровмПриближении.Регистратор) > 1)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ НайденныеСоответствияВПеровмПриближении
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТранзакцииПоСчету
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВведенныеДокументы";

	Запрос.Параметры.Вставить("Дата1", НачальнаяДата);
	Запрос.Параметры.Вставить("Дата2", КонечнаяДата);
	Запрос.Параметры.Вставить("СчетУчета", СчетУчета);
		
	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	НачатьТранзакцию();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ИсторияТранзакций.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.СчетУчета.Установить(ВыборкаДетальныеЗаписи.СчетУчета);
		НаборЗаписей.Отбор.Транзакция.Установить(ВыборкаДетальныеЗаписи.Транзакция);
		
		НаборЗаписей.Прочитать();
		
		Для Каждого Запись Из НаборЗаписей Цикл
		
			Запись.ДокументТранзакции = ВыборкаДетальныеЗаписи.Регистратор;
			
		КонецЦикла;

		НаборЗаписей.Записать(Истина);
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры
